# todo: Определить в коде переменные:
# 1. Целочисленного типа
a = 7
# 2. Вещественного типа
b = 5.8
# 3. Логического типа
c = True
# 4. Строкового типа
d = 'book'
# 5. Пустого типа
e = None
# Вывести их типы (надо погуглить).
print(*list(map(type, [a, b, c, d, e])))